init.org
#+TITLE: Emacs configuration
#+AUTHOR: Tom Hartman
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle ./init-test.el
 
* General Setup
** Preamble
This section contains the license and commentary for this elisp file. This both makes my elisp linter happy and also makes me happy. Or at least makes me feel like a responsible programmer.

*** License and Information
This configuration uses the GPL v2 license.

#+begin_src emacs-lisp
;;; init.el --- Emacs configuration and initialization file

;; Copyright (c) 2020 Thomas Hartman (thomas.lees.hartman@gmail.com)

;; This program is free software; you can redistribute it and/or
;; modify it under the terms of the GNU General Public License
;; as published by the Free Software Foundation; either version 2
;; of the License, or the License, or (at your option) any later
;; version.

;; This program is distributed in the hope that it will be useful
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
#+end_src


*** Commentary
#+begin_src emacs-lisp
;;; Commentary:
;; This is my Emacs configuration file.There are many like it but this one is mine.
;;
;; There is a lot of code in here that was lifted or modified from
;; other sources.Below is a non-exhaustive list of them:
;;
;; System Crafters Emacs from Scratch: https://github.com/daviwil/emacs-from-scratch
;;

;; 
#+end_src


*** And the Code Begins... Nowowowowoowowowowow
#+begin_src emacs-lisp
;;; Code:
#+end_src

** Bars
 Remove the menu, scroll, and toolbar. Remove the basic line number
 mode as well.

 #+begin_src emacs-lisp output

 (menu-bar-mode -1)
 (scroll-bar-mode -1)
 (tool-bar-mode -1)

 #+end_src

** Line Numbers
#+begin_src emacs-lisp

;; Set up the visible bell
(setq visible-bell t)

(column-number-mode)
(global-display-line-numbers-mode t)

;; Set frame transparency
;;(set-frame-parameter (selected-frame) 'alpha efs/frame-transparency)
;;(add-to-list 'default-frame-alist `(alpha . ,efs/frame-transparency))
;;(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
;;(add-to-list 'default-frame-alist '(fullscreen . maximized))

;; Disable line numbers for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Frist Buffer

Go directly to scratch buffer, do not pass go
#+begin_src emacs-lisp output

(setq startup-screen-inhibit-startup-screen t)

#+end_src

** Package Setup
Initialize the package repositories. Org mode in mainline emacs can be behind the stable development curve so add that in, in addition to melpa.

Setup the use-package package as well for ease of package management and configuration

   #+begin_src emacs-lisp
     ;; Initialize package sources
     (require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("nongnu" . "https://elpa.nongnu.org/nongnu/")
			 ("elpa" . "https://elpa.gnu.org/packages/")
;;			 ("org" . "https://orgmode.org/elpa/")
			 ))

     (package-initialize)
     (unless package-archive-contents
       (package-refresh-contents))

     ;; Initialize use-package on non-Linux platforms
     (unless (package-installed-p 'use-package)
       (package-install 'use-package))

     (require 'use-package)
     (setq use-package-always-ensure t)

     (use-package auto-package-update
	:ensure t
	:config
	(setq auto-package-update-delete-old-versions t
	      auto-package-update-interval 4)
	(auto-package-update-maybe))
   
   #+end_src

** Constants
#+begin_src emacs-lisp
(defvar *full-name* "Tom Hartman")
(defvar *email* "thomas.lees.hartman@gmail.com")

#+end_src

* Utilities

** Comment lines
#+begin_src emacs-lisp
(defun tlh/comment-lines (str beg end line-width)
  "Return a commented version of STR using BEG, END and LINE-WIDTH."
  (let ((lines (split-string str "\n")))
    (mapconcat #'(lambda (line)
                   (concat beg " " str (make-string (- line-width
                                                       (length str)
                                                       (+ (length beg) 1)
                                                       (length end)) ? )
                           end)) lines "\n")))

#+end_src

* Appearance
This section configures the overall apparance of emacs from fonts to themes, transpancy and other visual nicities.

** Font
Setup SauceCodePro from Nerd Font as the default font for buffers.

#+begin_src emacs-lisp
  
(add-to-list 'default-frame-alist '(font . "SauceCodePro Nerd Font Mono-8"))
 
#+end_src

** Theme
From the doom themes package use the doom-moonlight theme

#+begin_src emacs-lisp

;;(use-package doom-themes
;;  :init (load-theme 'doom-sourcerer t))
(use-package doom-themes
  :init (load-theme 'doom-acario-dark t))

#+end_src

** Transparency
A quick function to set the transparency of emacs when in window mode. I've found 80% to be the most comfortable.

#+begin_src emacs-lisp
(defun set-transparency (value)
  "Set the transparency `VALUE' of the frame window 0=transparent/100=opaque."
  (interactive "nTransparency Value 0 - 100: ")

  (set-frame-parameter (selected-frame) 'alpha value))
   
(set-transparency 90)
#+end_src

** Mixed Pitch
By default org mode is set to use variable pitch mode with tables using fixed pitch but this doesn't quite work as advertise. Mixed pitch mode resolves this issue. Setup is pretty straight forward just add a hook  for org-mode to enable mixed-pitch-mode.

To enable for all text modes add a hook for text-mode.

#+begin_src emacs-lisp
(use-package mixed-pitch
  :hook (org-mode . mixed-pitch-mode))
#+end_src

** All Icon Mode
#+begin_src emacs-lisp
(use-package all-the-icons-dired
  :config
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode))
#+end_src

** Mode Line
Updating the mode line for more awesome. Currently playing around with telephone line.

#+begin_src emacs-lisp
(use-package telephone-line
  :custom
  (telephone-line-primary-left-separator 'telephone-line-cubed-left)
  (telephone-line-secondary-left-separator 'telephone-line-cubed-hollow-left)
  (telephone-line-primary-right-separator 'telephone-line-cubed-right)
  (telephone-line-secondary-right-separator 'telephone-line-cubed-hollow-right)
  (telephone-line-height 16)
  (telephone-line-mode 1))
#+end_src

** Highlight Parenthesis
#+begin_src emacs-lisp
(use-package paren
  :config
  (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
  (show-paren-mode 1))
#+end_src

* UI Improvements
** Multiple Cursors
Initialize multiple cursors mode

#+begin_src emacs-lisp
(use-package multiple-cursors
  :ensure t)
#+end_src

** Which-key

#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1))
#+end_src

* Dired
Found this dired configuration changes over on the [[explog.in/dot/emacs/config.html][A literate emacs configuration]]. It removes permissions and other details from the dired view which makes the buffer look a lot less noisy.

#+begin_src emacs-lisp
(add-hook 'dired-mode-hook
	  (lambda ()
	    (dired-hide-details-mode 1)
	    (display-line-numbers-mode 0)))
#+end_src

* Spell Checking
Use fly-spell to spell check certain types of buffers
#+begin_src emacs-lisp
(add-hook 'org-mode-hook 'turn-on-flyspell)
#+end_src

* Org Mode
** General
General setup for org mode files, some of this is to enhance
readability as well as associate certain minor modes and other
constants.

Additionally I prefer my org files to starup collapse for easier navigation.

#+begin_src emacs-lisp
   
(defun efs/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))

(use-package org
;;  :pin org
  :hook (org-mode . efs/org-mode-setup)
  :ensure org-contrib
  :bind (("C-c a" . org-agenda))
  :config
  (auto-fill-mode)
  (setq org-startup-folded "fold")
  (setq org-ellipsis " ▾")
  (setq org-return-follows-link t)
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t))
#+end_src

** Babel
Setup babel source code blocks. Right now this is configured for shell and emacs-lisp.

The final line prevents org src code from altering the windowing within emacs. I borrows and existing window rather than doing a 50/50 split between the org target buffer and the source, which is super annoying.

#+begin_src emacs-lisp
(setf org-src-preserve-indentation t)

(org-babel-do-load-languages 'org-babel-load-languages
			     '((shell .t)
			       (emacs-lisp . t)))

(setf org-src-window-setup 'other-window)
#+end_src

** Structure Templates

 #+begin_src emacs-lisp

 (require 'org-tempo)
  
 (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
 (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
 (add-to-list 'org-structure-template-alist '("py" . "src python"))

 #+end_src
 
** Auto-tangle

This snippet adds a hook to org-mode buffers so that efs/org-babel-tangle-config gets executed each time such a buffer gets saved. This function checks to see if the file being saved is the Emacs.org file you’re looking at right now, and if so, automatically exports the configuration here to the associated output files.

#+begin_src emacs-lisp
;; Automatically tangle our Emacs.org config file when we save it
(defun efs/org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name user-emacs-directory))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src

** Center Org Buffers

We use visual-fill-column to center org-mode buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document. This is really a matter of personal preference so you can remove the block below if you don’t like the behavior.

#+begin_src emacs-lisp
(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))
#+end_src

** Better Bullets
org-bullets replaces the heading stars in org-mode buffers with nicer looking characters that you can control. Another option for this is org-superstar-mode which we may cover in a later video.

#+begin_src emacs-lisp
(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

** Org Agenda

Setup some default bindings as well as the location of agenda files. The final line is a configuration change similar to the one made for org-babel. By default opening an agenda buffer reorganizes the windows and frames so that only the current buffer and the new agenda buffer are presented in a 50/50 window split. This is super annoying.

#+begin_src emacs-lisp
(setf org-agenda-files '("~/notes/journal"))
(global-set-key (kbd "C-c a") 'org-agenda)

(setf org-agenda-window-setup 'other-window)
#+end_src

